Documents/ЗаказНаряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗаказНаряд</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Артикулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказНаряд/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ЗаказНаряд.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаряд.Автомобиль,
	|	ЗаказНаряд.Дата,
	|	ЗаказНаряд.Заказчик,
	|	ЗаказНаряд.Номер,
	|	ЗаказНаряд.Примечания,
	|	ЗаказНаряд.Пробег,
	|	ЗаказНаряд.Работы.(
	|		НомерСтроки,
	|		Наименование,
	|		Сумма
	|	),
	|	ЗаказНаряд.Материалы.(
	|		НомерСтроки,
	|		Наименование,
	|		Артикул,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка 					= Макет.ПолучитьОбласть("Шапка");
	ДанныеАвтомобиля 		= Макет.ПолучитьОбласть("ДанныеАвтомобиля");
	ДанныеЗаказчика 		= Макет.ПолучитьОбласть("ДанныеЗаказчика");	
	ОбластьРаботыШапка 		= Макет.ПолучитьОбласть("РаботыШапка");
	ОбластьРаботыСтрока 	= Макет.ПолучитьОбласть("РаботыСтрока");
	ОбластьРаботыИтого 		= Макет.ПолучитьОбласть("РаботыИтого");
	ОбластьМатериалыШапка 	= Макет.ПолучитьОбласть("МатериалыШапка");
	ОбластьМатериалыСтрока 	= Макет.ПолучитьОбласть("МатериалыСтрока");
	ОбластьМатериалыИтого 	= Макет.ПолучитьОбласть("МатериалыИтого");
	Подвал 					= Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Шапка.Параметры.Номер 						= Выборка.Номер;
		Шапка.Параметры.Дата 						= Формат(Выборка.Дата, "ДЛФ=Д");
		ТабДок.Вывести(Шапка);
		
		ДанныеАвтомобиля.Параметры.Марка 			= Выборка.Автомобиль.Марка;
		ДанныеАвтомобиля.Параметры.Модель 			= Выборка.Автомобиль.Модель;
		ДанныеАвтомобиля.Параметры.Пробег 			= Выборка.Пробег;
		ДанныеАвтомобиля.Параметры.ГосНомер 		= Выборка.Автомобиль.ГосНомер;
		ДанныеАвтомобиля.Параметры.VIN 				= Выборка.Автомобиль.VIN;
		ДанныеАвтомобиля.Параметры.ГодВыпуска 		= Выборка.Автомобиль.ГодВыпуска;
		ДанныеАвтомобиля.Параметры.КодДвигателя 	= Выборка.Автомобиль.КодДвигателя;
		ДанныеАвтомобиля.Параметры.ОбъемДвигателя 	= Выборка.Автомобиль.ОбъемДвигателя;
		ДанныеАвтомобиля.Параметры.ТипДвигателя 	= Выборка.Автомобиль.ТипДвигателя;
		ДанныеАвтомобиля.Параметры.ТипТрансмиссии 	= Выборка.Автомобиль.ТипТрансмиссии;
		ТабДок.Вывести(ДанныеАвтомобиля);
		
		ДанныеЗаказчика.Параметры.ФИО 				= Выборка.Заказчик.ФИО;
		ДанныеЗаказчика.Параметры.Телефон 			= Выборка.Заказчик.Телефон;
		ТабДок.Вывести(ДанныеЗаказчика);

		ТабДок.Вывести(ОбластьРаботыШапка);
		
		ВыборкаРаботы = Выборка.Работы.Выбрать();
		РаботыИтого = 0;
		Пока ВыборкаРаботы.Следующий() Цикл
			ОбластьРаботыСтрока.Параметры.Заполнить(ВыборкаРаботы);
			ТабДок.Вывести(ОбластьРаботыСтрока, ВыборкаРаботы.Уровень());
			РаботыИтого = РаботыИтого + ВыборкаРаботы.Сумма;
		КонецЦикла;
		
		ОбластьРаботыИтого.Параметры.РаботыИтого 	= РаботыИтого;
		ТабДок.Вывести(ОбластьРаботыИтого);

		ТабДок.Вывести(ОбластьМатериалыШапка);
		
		ВыборкаМатериалы = Выборка.Материалы.Выбрать();
		МатериалыИтого = 0;
		Пока ВыборкаМатериалы.Следующий() Цикл
			ОбластьМатериалыСтрока.Параметры.Заполнить(ВыборкаМатериалы);
			ОбластьМатериалыСтрока.Параметры.Артикул = ВыборкаМатериалы.Артикул;
			ТабДок.Вывести(ОбластьМатериалыСтрока, ВыборкаМатериалы.Уровень());
			МатериалыИтого = МатериалыИтого + ВыборкаМатериалы.Сумма;
		КонецЦикла;
		
		ОбластьМатериалыИтого.Параметры.МатериалыИтого = МатериалыИтого;
		ТабДок.Вывести(ОбластьМатериалыИтого);

		Подвал.Параметры.ВсегоРаботы 				= РаботыИтого;
		Подвал.Параметры.ВсегоМатериалы 			= МатериалыИтого;
		Подвал.Параметры.Всего 						= РаботыИтого + МатериалыИтого;
		Подвал.Параметры.Примечания 				= Выборка.Примечания;
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
